app/Controllers/Mahasiswa.php

SELECT *
FROM `mahasiswa`
---
    public function getData()
    {
        $model = new MahasiswaModel();
        $data = $model->findAll();

INSERT INTO `mahasiswa` (`nama`, `prodi`) VALUES ('Dani Setiaji', 'Informatika')
---
    public function simpan()
    {
        $model = new MahasiswaModel();
        $model->insert([
            'nama' => $this->request->getPost('nama'),
            'prodi' => $this->request->getPost('prodi')
        ]);